---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.AreaUnplaceWarning
source: html/dce88637-bbde-8c04-8282-e811776dfa00.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.AreaUnplaceWarning Property

An Area was deleted from all model views but still remains in this project. \n The area can be removed from any schedule or placed back in the model using the Area command.

## Syntax (C#)
```csharp
public static FailureDefinitionId AreaUnplaceWarning { get; }
```